Tekla Open API Reference for Tekla Structures 2025
CoordinateSystem Constructor (Point, Vector, Vector)
 Instantiates a coordinate system with the given origin, X-axis and Y-axis.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem(
	Point Origin,
	Vector AxisX,
	Vector AxisY
)
Public Sub New (
	Origin As Point,
	AxisX As Vector,
	AxisY As Vector
)
Parameters
Origin
Type: Tekla.Structures.Geometry3d.Point
The origin for the coordinate system.
AxisX
Type: Tekla.Structures.Geometry3d.Vector
The X-axis for the coordinate system.
AxisY
Type: Tekla.Structures.Geometry3d.Vector
The Y-axis for the coordinate system.
See Also
Reference
CoordinateSystem Class
CoordinateSystem Overload
Tekla.Structures.Geometry3d Namespace